Revit 2026 API

# XYZDivide Method

---

Divides this vector by the specified value and returns the result.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Divide(
	double value
)
```
```vb
Public Function Divide (
	value As Double
) As XYZ
```
```cpp
public:
XYZ^ Divide(
	double value
)
```
```fsharp
member Divide :
        value : float -> XYZ
```

#### Parameters

value Double
    The value to divide this vector by.

#### Return Value

XYZThe divided vector.

| Exception | Condition |
| --- | --- |
| ArgumentException | Thrown when the specified value is an infinite number or zero. |

The divided vector is obtained by dividing each coordinate of this vector by the specified value.

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace